//Необходимо написать программу, которая выводит надпись «Hello, world!».
//You need to write a program that displays the message “Hello, world!”

#include <iostream>

int main() {
  std::cout << "Hello, world!" << std::endl;
  return 0;
}